import pandas as pd


def create_row(row, link=""):
    """
    Excelの1行からCSV用の1行を作成する
    """

    if pd.notna(row["サークル名"]) and str(row["サークル名"]).strip() != "":
        return {
            "ホール": row["地区"],
            "スペース": str(row["区分"] if pd.notna(row["区分"]) else "") + str(row["場所"] if pd.notna(row["場所"]) else ""),
            "サークル名": row["サークル名"],
            "サークルメモ": "",
            "サークルタグ": "お品書き@" + link if link else "",
            "色": 0,
            "マップ番号": 0,
            "ピンX": -1.0,
            "ピンY": -1.0,
            "ピン型": 0,
            "ピン値": 0,
            "サークル画像": "",
            "アイテム名": row["購入内容"],
            "アイテム画像": "",
            "単価": f"{float(row['金額']):.1f}" if pd.notna(row["金額"]) else "0.0",
            "数量": row["数量"],
            "アイテムメモ": row["メモ"],
            "アイテムタグ": "",
            "チェック": 0,
            "買い物リスト名": "",
            "買い物メモ": ""
        }

    else:
        return {
            "ホール": "",
            "スペース": "",
            "サークル名": "",
            "サークルメモ": "",
            "サークルタグ": "",
            "色": "",
            "マップ番号": "",
            "ピンX": "",
            "ピンY": "",
            "ピン型": "",
            "ピン値": "",
            "サークル画像": "",
            "アイテム名": row["購入内容"],
            "アイテム画像": "",
            "単価": f"{float(row['金額']):.1f}" if pd.notna(row["金額"]) else "0.0",
            "数量": row["数量"],
            "アイテムメモ": row["メモ"],
            "アイテムタグ": "",
            "チェック": 0,
            "買い物リスト名": "",
            "買い物メモ": ""
        }